PROFANITIES = [
    'блять', 'блядь', 'ебать', 'ебаш', 'еб', 'еби', 'пизда', 'пиздец', 'хуй', 'хуйня', 'хуевый',
    'сука', 'суки', 'нахуй', 'нахui', 'охуй', 'охуел', 'охуена', 'охи', 'ахуел', 'ахуена',
    'ебанутый', 'еблан', 'ебанул', 'ебучий', 'ебышко', 'гавно', 'какашка', 'срать', 'срача',
    'бля', 'блин', 'беспизде', 'ебалово', 'долбоеб', 'дроч', 'дрочу', 'еб', 'ебу', 'еба',
    'блядина', 'блядь', 'ебаная', 'ебанное', 'ебаный', 'ебучее', 'ебучий', 'еля', 'ета'
]

def contains_profanity(text: str) -> bool:
    text_lower = text.lower()
    for word in PROFANITIES:
        if word in text_lower:
            return True
    return False
